/********************************************************************
*名称:charsDetect.h
*作者:D
*时间:2016.01.25
*功能:字符识别头文件
*********************************************************************/
#ifndef CHARSDETECT_H
#define CHARSDETECT_H

/********************************************************************
*头文件
*********************************************************************/
#include <iostream>
#include <cv.h>
#include <highgui.h>
#include <ml.h>

/********************************************************************
*宏定义
*********************************************************************/
#define CHARLENGTH 20   //字符调整长度

#define MINIASPECT 0.1     //最小宽高比 = 0.1，字符'1'的宽高比约等于0.1
#define CHARASPECT 0.5     //字符宽高比 = 45/90 = 0.5
#define CHARERROR 0.35     //宽高误差率 = 35%

#define MINCHARHEIGHT 15   //最小字符高度 = 15 pixels
#define MXNCHARHEIGHT 28   //最大字符高度 = 28 pixels

#define MINAREAPERCENT 0.2   //最小面积百分比 = 20%
#define MXNAREAPERCENT 0.8   //最大面积百分比 = 80%

#define CHARNUMBER 35   //字符数目
#define LOWSLENGTH 20   //低分辨率像素

/********************************************************************
*命名空间
*********************************************************************/
using namespace std;
using namespace cv;

/********************************************************************
*全局变量
*********************************************************************/
const char characters[CHARNUMBER] = {'0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'J', 'K', 'L', 'M', 'N', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', '_'};

/********************************************************************
*类型定义
*********************************************************************/
typedef struct chars{
	char cha;
	int  pos;
}CHARS;

/********************************************************************
*函数原型
*********************************************************************/
string charsDetect(Mat sourceImage);
bool verifyChar(Mat rect);
Mat getFeatures(Mat charImage);

#endif